lvx/base/DataProcessors/бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_конв_ПодразделенияОрганизацийСтруктураПредприятия</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_вго_ДанныеКорректировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_вго_ДанныеКорректировок</Name>
			<Comment>(БИТ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУ</Name>
					<Comment>Сумма в валюте международного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСуммаДт</Name>
					<Comment>Валютная сумма Дт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСуммаКт</Name>
					<Comment>Валютная сумма Кт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглДт</Name>
					<Comment>Сумма в валюте регламентированного учета (Дт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглКт</Name>
					<Comment>Сумма в валюте регламентированного учета (Кт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрДт</Name>
					<Comment>Сумма в валюте управленческого учета (Дт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрКт</Name>
					<Comment>Сумма в валюте управленческого учета (Кт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарийДт</Name>
					<Comment>Сумма в валюте сценария (Дт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарийКт</Name>
					<Comment>Сумма в валюте сценария (Кт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУДт</Name>
					<Comment>Сумма в валюте международного учета (Дт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУКт</Name>
					<Comment>Сумма в валюте международного учета (Кт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперацияВГО</Name>
					<Comment>Операция ВГО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_вго_ОперацииВГО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаРасхождения</Name>
					<Comment>Причина расхождения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_вго_ПричиныРасхождений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеДт</Name>
					<Comment>Подразделение Дт</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКт</Name>
					<Comment>Подразделение Кт</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаДт</Name>
					<Comment>Валюта Дт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаКт</Name>
					<Comment>Валюта Кт</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДт</Name>
					<Comment>Счет Дт</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКт</Name>
					<Comment>Счет Кт</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_5</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_4</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_3</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_1</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт_1</Name>
					<Comment>Субконто Дт 1</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт_2</Name>
					<Comment>Субконто Дт 2</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт_3</Name>
					<Comment>Субконто Дт 3</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоДт_4</Name>
					<Comment>Субконто Дт 4</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт_1</Name>
					<Comment>Субконто Кт 1</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт_2</Name>
					<Comment>Субконто Кт 2</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт_3</Name>
					<Comment>Субконто Кт 3</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоКт_4</Name>
					<Comment>Субконто Кт 4</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанныхКорректировок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_вго_ТипыДанныхКорректировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/Documents/бит_му_ВыработкаВНА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_ВыработкаВНА</Name>
			<Comment>(БИТ МУ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_му_ВыработкаВНА</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыОперацийВыработкаВНА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ПодразделениеМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>МОЛ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВНА</Name>
					<Comment>ВНА</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектВНА</Name>
							<Comment>Основное средство/Нематериальный актив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/DataProcessors/бит_конв_ПодразделенияОрганизацийСтруктураПредприятия/Forms/Форма/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Загрузка соответствий из регистра. 
//
// Параметры:
//
&НаСервере
Процедура ЗагрузитьСоответсвия()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.Организация,
		|	бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.ПодразделениеОрганизации,
		|	бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.СтруктураПредприятия
		|ИЗ
		|	РегистрСведений.бит_конв_ПодразделенияОрганизацийСтруктураПредприятия КАК бит_конв_ПодразделенияОрганизацийСтруктураПредприятия";
		
	ТаблицаСоответствий = Запрос.Выполнить().Выгрузить();
	
	ЗапросДокументы = ПолучитьЗапросДокументовМСФО();
	Выборка = ЗапросДокументы.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МетаОб = Выборка.Документ.Метаданные();
		
		// Ограничение для подразделений
		Для каждого МетаРеквизит Из МетаОб.Реквизиты Цикл
		
			Если МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.ПодразделенияОрганизаций")) 
				 И МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) 
			     И Найти(МетаРеквизит.Имя, "Субконто") = 0 Тогда
				 
				 Подразделение = Выборка.Документ[МетаРеквизит.Имя];
				 
				 Если ЗначениеЗаполнено(Подразделение) Тогда
					 
					 Если ТаблицаСоответствий.Найти(Подразделение, "ПодразделениеОрганизации") = Неопределено Тогда
						НоваяСтрокаСоответствия = ТаблицаСоответствий.Добавить();
						НоваяСтрокаСоответствия.ПодразделениеОрганизации =  Подразделение;
						НоваяСтрокаСоответствия.Организация = Подразделение.Владелец;
					КонецЕсли;
					
				 КонецЕсли;
				
			КонецЕсли;
					
		КонецЦикла; 

		Для каждого МетаТЧ Из МетаОб.ТабличныеЧасти Цикл
		
			Для каждого МетаРеквизитТЧ Из МетаТЧ.Реквизиты Цикл
			
				Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.ПодразделенияОрганизаций")) 
					И МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) 
					И Найти(МетаРеквизитТЧ.Имя, "Субконто") = 0 Тогда
					 
					Для Каждого СтрТЧ Из Выборка.Документ[МетаТЧ.Имя] ЦИкл 
						
						Подразделение = СтрТЧ[МетаРеквизитТЧ.Имя];
						Если ЗначениеЗаполнено(Подразделение) Тогда
							Если ТаблицаСоответствий.Найти(Подразделение, "ПодразделениеОрганизации") = Неопределено Тогда
								НоваяСтрокаСоответствия = ТаблицаСоответствий.Добавить();
								НоваяСтрокаСоответствия.ПодразделениеОрганизации =  Подразделение;
								НоваяСтрокаСоответствия.Организация = Подразделение.Владелец;
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли; 
			
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;

	Для Каждого Эл Из ТаблицаСоответствий Цикл
		НоваяСтрока = СоответствияПодразделениеСтруктураПредприятия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Эл);
	КонецЦикла;

КонецПроцедуры // ЗагрузитьСоответсвия()

// Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат - Строка.
//
&НаСервере
Функция ПолучитьЗапросДокументовМСФО()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_вго_АктСверкиВГО.Ссылка КАК Документ,
		|	ТИПЗНАЧЕНИЯ(бит_вго_АктСверкиВГО.Ссылка) КАК ТипДокумента
		|ИЗ
		|	Документ.бит_вго_АктСверкиВГО КАК бит_вго_АктСверкиВГО
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_вго_АктСверкиВГО.Проводки.ПодразделениеРасчетов) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_АктСверкиВГО.Проводки.ПодразделениеРасчетов <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ бит_вго_АктСверкиВГО.Проводки.ПодразделениеКор <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(бит_вго_АктСверкиВГО.Проводки.ПодразделениеКор) = ТИП(Справочник.ПодразделенияОрганизаций))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_вго_ПротоколРасхождений.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_вго_ПротоколРасхождений.Ссылка)
		|ИЗ
		|	Документ.бит_вго_ПротоколРасхождений КАК бит_вго_ПротоколРасхождений
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_вго_ПротоколРасхождений.Проводки.ПодразделениеДт) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_ПротоколРасхождений.Проводки.ПодразделениеДт <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ ТИПЗНАЧЕНИЯ(бит_вго_ПротоколРасхождений.Проводки.ПодразделениеКт) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_ПротоколРасхождений.Проводки.ПодразделениеКт <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ВыбытиеОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ВыбытиеОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ВыбытиеОС КАК бит_му_ВыбытиеОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ВыбытиеОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ВыбытиеОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ВыработкаВНА.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ВыработкаВНА.Ссылка)
		|ИЗ
		|	Документ.бит_му_ВыработкаВНА КАК бит_му_ВыработкаВНА
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ВыработкаВНА.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ВыработкаВНА.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ИзменениеПараметровУчетаОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ИзменениеПараметровУчетаОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ИзменениеПараметровУчетаОС КАК бит_му_ИзменениеПараметровУчетаОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ИзменениеПараметровУчетаОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ИзменениеПараметровУчетаОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_МодернизацияОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_МодернизацияОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_МодернизацияОС КАК бит_му_МодернизацияОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_МодернизацияОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_МодернизацияОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_НачислениеАмортизацииОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_НачислениеАмортизацииОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_НачислениеАмортизацииОС КАК бит_му_НачислениеАмортизацииОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_НачислениеАмортизацииОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_НачислениеАмортизацииОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ОбесценениеОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ОбесценениеОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ОбесценениеОС КАК бит_му_ОбесценениеОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ОбесценениеОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ОбесценениеОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ПереводОСВСоставИнвестиционнойСобственности.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ПереводОСВСоставИнвестиционнойСобственности.Ссылка)
		|ИЗ
		|	Документ.бит_му_ПереводОСВСоставИнвестиционнойСобственности КАК бит_му_ПереводОСВСоставИнвестиционнойСобственности
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ПереводОСВСоставИнвестиционнойСобственности.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ПереводОСВСоставИнвестиционнойСобственности.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ПеремещениеОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ПеремещениеОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ПеремещениеОС КАК бит_му_ПеремещениеОС
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_му_ПеремещениеОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_му_ПеремещениеОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ ТИПЗНАЧЕНИЯ(бит_му_ПеремещениеОС.ОсновныеСредства.Местонахождение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_му_ПеремещениеОС.ОсновныеСредства.Местонахождение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ ТИПЗНАЧЕНИЯ(бит_му_ПеремещениеОС.ОсновныеСредства.Местонахождение_старый) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_му_ПеремещениеОС.ОсновныеСредства.Местонахождение_старый <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ПереоценкаОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ПереоценкаОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ПереоценкаОС КАК бит_му_ПереоценкаОС
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(бит_му_ПереоценкаОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|	И бит_му_ПереоценкаОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_му_ПринятиеКУчетуОС.Ссылка,
		|	ТИПЗНАЧЕНИЯ(бит_му_ПринятиеКУчетуОС.Ссылка)
		|ИЗ
		|	Документ.бит_му_ПринятиеКУчетуОС КАК бит_му_ПринятиеКУчетуОС
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_му_ПринятиеКУчетуОС.Подразделение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_му_ПринятиеКУчетуОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ ТИПЗНАЧЕНИЯ(бит_му_ПринятиеКУчетуОС.ОсновныеСредства.Местонахождение) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_му_ПринятиеКУчетуОС.ОсновныеСредства.Местонахождение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))";
		

	Возврат Запрос;
	
КонецФункции // ПолучитьПодразделенияМСФО()
 
//  
//
// Параметры:
//
&НаСервере
Функция ПроверитьСоответствияНаУникальность()

	Результат = Ложь;
	
	Для Каждого Эл Из СоответствияПодразделениеСтруктураПредприятия Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ПодразделениеОрганизации", Эл.ПодразделениеОрганизации);
		
		Строки = СоответствияПодразделениеСтруктураПредприятия.НайтиСтроки(ПараметрыОтбора);
		
		Если Строки.Количество() > 1 Тогда
			Результат = Истина;
			
			Сообщить("Невозможно установить соответствие более, чем одному подразделению организации, удалите дополнительные записи и повторите попытку.");
			
			Прервать;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Эл.СтруктураПредприятия) Тогда
			Результат = Истина;
			
			Сообщить("Заполните все соответствия.");
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции // ПроверитьСоответствияНаУникальность()

//  
//
// Параметры:
//
&НаСервере
Процедура ЗаписатьСоответствияВРегистрНаСервере()

	НаборЗаписей = РегистрыСведений.бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого Элем Из СоответствияПодразделениеСтруктураПредприятия Цикл 
		
		СтрНабораЗаписей = НаборЗаписей.Добавить();
		СтрНабораЗаписей.Организация              = Элем.Организация;
		СтрНабораЗаписей.ПодразделениеОрганизации = Элем.ПодразделениеОрганизации;
		СтрНабораЗаписей.СтруктураПредприятия     = Элем.СтруктураПредприятия;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры // ЗаписатьСоответствияВРегистрНаСервере()

// Загрузка документов для выполнения конвертации. 
//
// Параметры:
//
&НаСервере
Процедура ЗагрузитьДокументыДляКонвертации()
	
	Запрос = ПолучитьЗапросДокументовМСФО();
	
	ДокументыКонвертация.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры // ЗагрузитьДокументыДляКонвертации()

//  
//
// Параметры:
//
&НаСервере
Процедура ВыполнитьконвертациюНаСервере()

	КоличествоУспешных = 0;
	
	КоличествоВсего = ДокументыКонвертация.Количество();

	ТекстПротокола = НСтр("ru='Конвертация: Подразделения организаций -> Структура предприятия';
						  |en='Conversion: units of the Organization -> Company Structure'") + Символы.ПС + Символы.ПС;

	ВыполнитьКонвертациюДляРегистраНакопления(ТекстПротокола);
	
	ТекстПротокола = ТекстПротокола + НСтр("ru='Обработка документов:';en='Document processing:'") + Символы.ПС;

	Для Каждого Док Из ДокументыКонвертация Цикл
		
		МетаОб = Док.Документ.Метаданные();

		ДокОбъект = Док.Документ.ПолучитьОбъект();
		
		// Ограничение для подразделений
		Для каждого МетаРеквизит Из МетаОб.Реквизиты Цикл
		
			Если МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.ПодразделенияОрганизаций")) 
				 И МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) Тогда
				 
				 ДокОбъект[МетаРеквизит.Имя] = ПолучитьСтруктураПредприятия(ДокОбъект[МетаРеквизит.Имя]);
				
			КонецЕсли; 
		
		КонецЦикла; 
		
		Для каждого МетаТЧ Из МетаОб.ТабличныеЧасти Цикл
			
			Для каждого МетаРеквизитТЧ Из МетаТЧ.Реквизиты Цикл
			
				Если МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.ПодразделенияОрганизаций")) 
					 И МетаРеквизитТЧ.Тип.СодержитТип(Тип("СправочникСсылка.СтруктураПредприятия")) Тогда
				
					 Для Каждого СтрТЧ Из ДокОбъект[МетаТЧ.Имя] ЦИкл 
						 
						Если ТипЗнч(СтрТЧ[МетаРеквизитТЧ.Имя]) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
							
							СтрТЧ[МетаРеквизитТЧ.Имя] = ПолучитьСтруктураПредприятия(СтрТЧ[МетаРеквизитТЧ.Имя]);

						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли; 
			
			КонецЦикла; 
			
		КонецЦикла;

		Успешно = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокОбъект, РежимЗаписиДокумента.Запись,,"Ошибки");
						
		Если Успешно Тогда
			КоличествоУспешных = КоличествоУспешных + 1;
		Иначе	
			ТекстСообщения = НСтр("ru = '%1Не удалось записать документ %2';en='%1Could not write the document %2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстПротокола, ДокОбъект.Ссылка);
			ТекстПротокола = ТекстПротокола + ТекстСообщения + Символы.ПС;	
		КонецЕсли; 
						
	КонецЦикла;
	
	// Всего.
	ТекстСообщения = НСтр("ru = '%1Всего %2';en='%1Total %2'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстПротокола, КоличествоВсего);
	ТекстПротокола = ТекстПротокола + ТекстСообщения + Символы.ПС;
	// Успешно обработано.
	ТекстСообщения = НСтр("ru = '%1Успешно обработано %2';en='%1Successfully processed %2'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстПротокола, КоличествоУспешных);
	ТекстПротокола = ТекстПротокола + ТекстСообщения + Символы.ПС;
	
	ВывестиПротоколКонвертации(ТекстПротокола);
	
КонецПроцедуры // ВыполнитьконвертациюНаСервере()

// Вывод протокола конвертации в поле табличного документа. 
//
// Параметры:
//  ТекстПротокола - Строка.
//
&НаСервере
Процедура ВывестиПротоколКонвертации(ТекстПротокола)

	дШрифт = Новый Шрифт(,12);
	
	Элементы.ПротоколКонвертации.ТекущаяОбласть.СодержитЗначение = Истина;
	Элементы.ПротоколКонвертации.ТекущаяОбласть.ТипЗначения = Новый ОписаниеТипов("Строка");
	Элементы.ПротоколКонвертации.ТекущаяОбласть.Значение = ТекстПротокола;
	Элементы.ПротоколКонвертации.ТекущаяОбласть.Шрифт = дШрифт;
	
КонецПроцедуры // ВывестиПротоколКонвертации()

// 
//
// Параметры:
//  ПодразделениеОрганизации - СправочникСсылка.СтруктураПредприятия.
//
&НаСервере
Функция ПолучитьСтруктураПредприятия(ПодразделениеОрганизации)

	СтруктураПредприятия = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.СтруктураПредприятия
		|ИЗ
		|	РегистрСведений.бит_конв_ПодразделенияОрганизацийСтруктураПредприятия КАК бит_конв_ПодразделенияОрганизацийСтруктураПредприятия
		|ГДЕ
		|	бит_конв_ПодразделенияОрганизацийСтруктураПредприятия.ПодразделениеОрганизации = &ПодразделениеОрганизации";
	
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПредприятия = Выборка.СтруктураПредприятия;
	КонецЦикла;
	
    Возврат СтруктураПредприятия;

КонецФункции // ПолучитьСтруктураПредприятия()

// Выполнение конвертации записец регистра накопления "бит_вго_ДанныеКорректировок" 
//
// Параметры:
//  ТекстПротокола - Строка.
//
&НаСервере
Процедура ВыполнитьКонвертациюДляРегистраНакопления(ТекстПротокола)
	
	Запрос = Новый Запрос;                                                                                              
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_вго_АктСверкиВГО.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.бит_вго_АктСверкиВГО КАК бит_вго_АктСверкиВГО
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_вго_АктСверкиВГО.Проводки.ПодразделениеРасчетов) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_АктСверкиВГО.Проводки.ПодразделениеРасчетов <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ бит_вго_АктСверкиВГО.Проводки.ПодразделениеКор <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(бит_вго_АктСверкиВГО.Проводки.ПодразделениеКор) = ТИП(Справочник.ПодразделенияОрганизаций))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_вго_ПротоколРасхождений.Ссылка
		|ИЗ
		|	Документ.бит_вго_ПротоколРасхождений КАК бит_вго_ПротоколРасхождений
		|ГДЕ
		|	(ТИПЗНАЧЕНИЯ(бит_вго_ПротоколРасхождений.Проводки.ПодразделениеДт) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_ПротоколРасхождений.Проводки.ПодразделениеДт <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ИЛИ ТИПЗНАЧЕНИЯ(бит_вго_ПротоколРасхождений.Проводки.ПодразделениеКт) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И бит_вго_ПротоколРасхождений.Проводки.ПодразделениеКт <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоЗаписей = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыНакопления.бит_вго_ДанныеКорректировок.СоздатьНаборЗаписей();
        Набор.Отбор.Регистратор.Установить(Выборка.ДокументСсылка);
        Набор.Прочитать();
		
		Для Каждого Движение Из Набор Цикл
			
			Если ТипЗнч(Движение.ПодразделениеДт) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				Движение.ПодразделениеДт = ПолучитьСтруктураПредприятия(Движение.ПодразделениеДт);
			КонецЕсли;
			
			Если ТипЗнч(Движение.ПодразделениеКт) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				Движение.ПодразделениеКт = ПолучитьСтруктураПредприятия(Движение.ПодразделениеКт);
			КонецЕсли;

			КоличествоЗаписей = КоличествоЗаписей +1;
			
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЦикла;	

	ТекстПротокола = ТекстПротокола + НСтр("ru='Обработка регистров накопления:';en='Processing accumulation registers:'") + Символы.ПС;
	ТекстСообщения = НСтр("ru = 'Сконвертировано %1 записей.';en='Converted %1 records.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, КоличествоЗаписей);
	ТекстПротокола = ТекстПротокола + ТекстСообщения + Символы.ПС + Символы.ПС;

КонецПроцедуры // ВыполнитьКонвертациюДляРегистраНакопления()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСоответсвия();
	
	ЗагрузитьДокументыДляКонвертации();
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКомандФормы

&НаКлиенте
Процедура ЗаписатьСоответствияВРегистр(Команда)
	
	Если Не ПроверитьСоответствияНаУникальность() Тогда
			
		ЗаписатьСоответствияВРегистрНаСервере();
				
		Модифицированность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКонвертацию(Команда)
	
	Если Модифицированность Тогда
		Сообщить("Перед выполнением конвертации необходимо записать соответствия в регистр");
		
	Иначе
		
		ВыполнитьконвертациюНаСервере();
		
		ЗагрузитьДокументыДляКонвертации();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобтыийТабличныхЧастейФормы

&НаКлиенте
Процедура СоответствияПодразделениеСтруктураПредприятияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти
